--[[ 
▀▄ ▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀          
▀▄ ▄▀                                      ▀▄ ▄▀ 
▀▄ ▄▀     BY(@AHMED_ALOBIDE)               ▀▄ ▄▀ 
▀▄ ▄▀      BY(@hussian_9)                  ▀▄ ▄▀ 
▀▄ ▄▀                                      ▀▄ ▄▀   
▀▄ ▄▀            ( لاوامر 2)               ▀▄ ▄▀ 
▀▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀
--]]
do

local function run(msg, matches)
if is_momod(msg) and matches[1]== "اوامر 2" then
return [[
➖➖➖➖➖➖➖➖➖➖➖
🔲👮🏻اوامر2 لرفع ادمنية والكتم👮🏻🔲
➖➖➖➖➖➖➖➖➖➖➖
🔲👮🏻رفع🏋ادمن (لاضافة ادمن)
🔳👮🏻تنزيل🏌‍♀️ ادمن (تنزيل ادمن)
🔲👮🏻الادمنيه👥(اضهار الادمنية)
🔳👮🏻بلوك🚶(لطرد المستخدم بالرد)
🔲👮🏻حظر📵(لحضر المستخدم)
🔳👮🏻الغاء✅الحظرلفك حضر المستخدم
🔲👮🏻مغادرة🏃‍♀️(للخروج من المجموعه)
🔳👮🏻كتم🔕(لكنم المستخدم)
🔲👮🏻كتم 🔔(لالغاء كتم المستخدم)
🔳👮🏻المكتومين📢(عرض المكتومين)
🔲👮🏻منع🆎(لحضرالكلمات في المجموعة
🔳👮🏻قائمة🅰المنع عرض الكلمات المجموعة
🔲👮🏻حظر📛عام (باند عام)
🔳👮🏻الغاء📴العام (لالغاء الحضر)
🔲👮🏻قائمه المنع لعرض الكلمات المحضور
🔳👮🏻حظر♓️عام (باند عام )
🔲👮🏻الغاء🕎العام (لالغاء العام)
🔳👮🏻قائمه💟العام (لعرض المحضورين
🔳👮🏻معلومات📚المجموعه
🔳👮🏻الادارين🕵
🔳👮🏻مدير🎖المجموعه
🔳👮🏻كشف🤖بوت
🔳👮🏻ايدي🆔الاعضاء
🔳👮🏻اعدادت📹الوسائط
🔳👮🏻المراقبه👀
➖➖➖➖➖➖➖➖➖➖➖
@AHMED_ALOBIDE   : المطور
المطور:  @hussian_9
المطور: @Tiq_ll
]]
end

if not is_momod(msg) then
return "مو شغلك ودعبل 😎🖕🏿"
end

end
return {
description = "Help list", 
usage = "Help list",
patterns = {
"(اوامر 2)"
},
run = run 
}
end
