--[[ 
▀▄ ▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀          
▀▄ ▄▀                                      ▀▄ ▄▀ 
▀▄ ▄▀     BY(@AHMED_ALOBIDE)               ▀▄ ▄▀ 
▀▄ ▄▀      BY(@hussian_9)                  ▀▄ ▄▀ 
▀▄ ▄▀                                      ▀▄ ▄▀   
▀▄ ▄▀          (ملف الاوامر 3)                ▀▄ ▄▀ 
▀▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀
--]]
do

local function run(msg, matches)
if is_momod(msg) and matches[1]== "اوامر 3" then
return [[
➖➖➖➖➖➖➖➖➖➖➖
🔲👮🏻اوامر3المطورين فقط لتلعب بكيفك👮🏻🔲
➖➖➖➖➖➖➖➖➖➖➖
🔲👮🏻ترقيه سوبر (لترقية المجموعه سوبر)
🔲👮🏻تفعيل (لتفعيل البو ت ب المجموعه)
🔲👮🏻تعطيل (لتفعيل البوت ب المجموعه)
🔲👮🏻رفع المدير (لرفع مدير للمجموعه)
🔲👮🏻رفع اداري(لرفع اداري للمجموعه)
🔲👮🏻اذاعه لنشر كلمة بجميع مجموعات البوت
🔲👮🏻تشغيل البوت لتشغيل البوت بالمجموعة
🔲👮🏻اطفاء البوت (لاطفاء البوت بالمجموعه)
🔲👮🏻اضف مطور (لاضافة مطور)
🔲👮🏻طرد البوت (لطرد البوت من المجموعه)
🔲👮🏻جلب ملف (لجلب ملف من السيرفر)
🔲👮🏻اصدار (لعرض محتويات البوت)
🔲👮🏻اضف بوت الرابط لضافة البوت للمجموعة
🔲👮🏻صنع مجموعه + اسم لعمل مجموعه
🔲👮🏻بلوك لطرد العضو🐢
➖➖➖➖➖➖➖➖➖➖➖
@AHMED_ALOBIDE   : المطور       
المطور:@hussian__9
المطور: @Tiq_ll
]]
end

if not is_momod(msg) then
return "مو شغلك ودعبل 😎🖕🏿"
end

end
return {
description = "Help list", 
usage = "Help list",
patterns = {
"(اوامر 3)"
},
run = run 
}
end
