--[[ 
▀▄ ▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀          
▀▄ ▄▀                                      ▀▄ ▄▀ 
▀▄ ▄▀     BY(@AHMED_ALOBIDE)               ▀▄ ▄▀ 
▀▄ ▄▀      BY(@hussian_9)                  ▀▄ ▄▀ 
▀▄ ▄▀                                      ▀▄ ▄▀   
▀▄ ▄▀          (ملف الهيلب انكلش)               ▀▄ ▄▀ 
▀▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀
--]]
do

local function run(msg, matches)
if is_momod(msg) and matches[1]== "help" then
return [[
〰〰〰〰〰〰〰〰〰〰 
👁‍🗨المساعدة / اهلا وسهلا بكم بالتعليمات 👁‍🗨
〰〰〰〰〰〰〰〰〰〰
🚺الاوامر العربية / اكتب الجملة الاتية اكتب الارقام بالنكليزي مع مسافة بالوصط
👁‍🗨الاوامر 1 اوامر القفل في المجموعه
💭الاوامر 2اوامر المجموعة والخصوصية
👁‍🗨الاوامر 3 اوامر المطور المحترم 🕵
👁‍🗨الاوامر 4 اوامر المطور المحترم 🕵
〰〰〰〰〰〰〰〰〰〰
🚺الاوامر الانكلش/اكتب الجملة الاتية
💭/list1 اوامر المختصة بالاقفال الميديا
👁‍🗨/list2 اوامر خاصة بالطرد والكتم
💭/list3 اوامر خاصة بالاذان والطقس
👁‍🗨/sudo اوامر المطور المحترم 🕵
〰〰〰〰〰〰〰〰〰〰
المطور : @hussian_9
المطور : @AHMED_ALOBIDE
المطور : @Tiq_ll
]]
end

end
return {
description = "Help list", 
usage = "Help list",
patterns = {
"[#!/](help)"
},
run = run 
}
end
